from openpyxl import Workbook

wb = Workbook()

ws = wb.active
ws.title = "قائمة الدخل"

data = [
("الحقل","القيمة"),
("الإيرادات",0),
("تكلفة المبيعات",0),
("المصاريف التشغيلية",0),
("الاستهلاك والإطفاء",0),
("مصاريف الفائدة",0),
("معدل الضريبة",15),
]

for r in data:
    ws.append(r)


ws = wb.create_sheet("الميزانية")

data = [
("الحقل","القيمة"),
("النقد وما في حكمه",0),
("الذمم المدينة",0),
("المخزون",0),
("الأصول الثابتة",0),
("مجمع الاستهلاك",0),
("الذمم الدائنة",0),
("قروض قصيرة الأجل",0),
("قروض طويلة الأجل",0),
("رأس المال",0),
("الأرباح المحتجزة",0),
]

for r in data:
    ws.append(r)


ws = wb.create_sheet("التدفقات النقدية")

data = [
("الحقل","القيمة"),
("صافي الدخل",0),
("الاستهلاك المضاف",0),
("تغير الذمم المدينة",0),
("تغير المخزون",0),
("تغير الذمم الدائنة",0),
("النفقات الرأسمالية",0),
("بداية النقد",0),
]

for r in data:
    ws.append(r)


wb.save("FYQ_Import_Template.xlsx")

print("Template created")
